#include<iostream>
#include<windows.h>
using namespace std;

//int CheckSystem()
//{
//	int a = 1;
//	return (char)a;//*(char*)&a
//}

//int CheckSystem()
//{
//	union A
//	{
//		int i;
//		char c;
//	};
//	A a;
//	a.i = 1;
//	return a.c;
//}
//int main()
//{
//	int ret = CheckSystem();
//	if (ret == 1)
//	{
//		cout << "小端" << endl;
//	}
//	else
//	{
//		cout << "大端" << endl;
//	}
//	system("pause");
//	return 0;
//}

//大端：把数据低位字节序的内容存储到高地址  把数据高位字节序的内容存储到低地址
//小端：把数据低位字节序的内容存储到低地址  把数据高位字节序的内容存储到高地址

//11111111111111111111111111111111
//11111111111111111111111111111110
//10000000000000000000000000000001

//00000000000000000000000011111111
//00000000000000000000000011111110
//01111111111111111111111100000001

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);//无符号数不区分源码，反码，补码
//	system("pause");
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	unsigned char b = 128;//u%输出的数字相同(42.....) %d输出的数字都为-128
//	printf("%u\n", b);
//	system("pause");
//	return 0;
//}

//00000000000000000000000010000000
//11111111111111111111111110000000
//11111111111111111111111101111111
//10000000000000000000000010000000

//10000000000000000000000010000001
//11111111111111111111111101111110
//11111111111111111111111101111111

//int main()
//{
//	int i = 0;
//	int k = 0;
//	for (i = 0, k = 0; k = 0; i++, k++)//不执行循环
//		k++;
//	system("pause");
//	return 0;
//}
//100000000000000000000000000010100
//111111111111111111111111111101011
//111111111111111111111111111101100

//000000000000000000000000000001010
//111111111111111111111111111110110
//111111111111111111111111111110101
//100000000000000000000000000001010

//转义字符：\n \t \v \r \\ \' \" \b \a \f \? \ddd \xddd

//int main()
//{
//	int sum = 1;
//	int partsum = 0;
//	for (int i = 1; i <= 3; i++)
//	{
//		sum *= i;
//		partsum += sum;
//	}
//	cout << partsum << endl;
//	system("pause");
//	return 0;
//}

//int main()//goto语句
//{
//again:
//	printf("hello world\n");
//	goto again;
//
//	system("pause");
//	return 0;
//}